# Quantized trained SSD with Mobilenet v2 on MSCOCO Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "PATH_TO_BE_CONFIGURED" to find the fields that
# should be configured.

model {
  ssd {
    num_classes: 16
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v2'
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
    }
    loss {
      classification_loss {
        weighted_sigmoid {
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.99
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 3
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  from_detection_checkpoint: true
  batch_size: 16
  data_augmentation_options {
    ssd_random_crop {
      operations {
        min_object_covered: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
        min_area: 0.1
        max_area: 1.0
        overlap_thresh: 1.0
        random_coef: 0.5
      }
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
  data_augmentation_options {
    random_adjust_contrast  {
    }
  }
  data_augmentation_options {
    random_adjust_saturation {
    }
  }
  data_augmentation_options {
    adjust_gamma {
      gamma: 0.8
    }
  }
  optimizer {
    momentum_optimizer {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.002
          decay_steps: 4500
          decay_factor: 0.96
          staircase: true
          burnin_learning_rate: 0.0
          burnin_steps: 0
          min_learning_rate: 0.0
        }
      }
      momentum_optimizer_value: 0.9
    }
  }
  fine_tune_checkpoint: "/content/drive/MyDrive/shared_resource/model-ssd_mobilenet_v2_quantized_300x300_coco_2019_01_03/model.ckpt"
  fine_tune_checkpoint_type:  "detection"
  # Note: The below line limits the training process to 200K steps, which we
  # empirically found to be sufficient enough to train the pets dataset. This
  # effectively bypasses the learning rate schedule (the learning rate will
  # never decay). Remove the below line to train indefinitely.
  num_steps: 500000
}

train_input_reader {
  tf_record_input_reader {
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_pickup_bar-image_and_pascal_voc_set-1.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_pickup_bar-image_and_pascal_voc_set-2.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_pickup_bar-image_and_pascal_voc_set-3.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_pickup_bar-image_and_pascal_voc_set-4.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_pickup_bar-image_and_pascal_voc_set-5.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_pickup_bar-image_and_pascal_voc_set-6.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_image_task_211019_AreaSample_no_exif_true.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/train_task_training_unknown-2021_12_14_08_33_18.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_bagel.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_cheese_cake.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_croissant.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_fruit_cake.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_macaron.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_muffin.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_mug.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_scone.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_square_sandwich.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_takeout_hot.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_takeout_ice.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_tiramisu.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_triangle_sandwich.record"
  #   input_path: "/content/drive/MyDrive/shared_resource/annotations/train_tumbler.record"
  }
  sample_from_datasets_weights: 2.0
  sample_from_datasets_weights: 1.0
  sample_from_datasets_weights: 1.0
  sample_from_datasets_weights: 2.0
  sample_from_datasets_weights: 1.0
  sample_from_datasets_weights: 1.0
  sample_from_datasets_weights: 1.0
  sample_from_datasets_weights: 0.5

  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.5
  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.5
  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.5
  # sample_from_datasets_weights: 1.5
  # sample_from_datasets_weights: 1.5
  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.0
  # sample_from_datasets_weights: 1.5
  label_map_path: "/content/drive/MyDrive/shared_resource/annotations/my_label_map.pbtxt"
  shuffle: true
  # Buffer size to be used when shuffling file names. I set this as max of the number of each object class. 27*2*28
  filenames_shuffle_buffer_size: 1512
  # The number of weights must match the number of input files configured.
  num_readers: 64

}

eval_config: {
  # (Optional): Set this to the number of images in your <PATH_TO_IMAGES_FOLDER>/train
  # if you want to also run evaluation
  num_examples: 18144
  # Note: The below line limits the evaluation process to 10 evaluations.
  # Remove the below line to evaluate indefinitely.
  max_evals: 10
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/content/drive/MyDrive/shared_resource/annotations/test_image_tasks_sorted_test_dataset.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/test_image_task_211019_AreaSample_no_exif_test_dataset.record"
    input_path: "/content/drive/MyDrive/shared_resource/annotations/test_task_training_unknown_list_sorted_test_dataset.record"
  }
  label_map_path: "/content/drive/MyDrive/shared_resource/annotations/my_label_map.pbtxt"
  shuffle: false
  num_readers: 64
}


graph_rewriter {
  quantization {
    delay: 48000
    weight_bits: 8
    activation_bits: 8
  }
}